RedditApp/app/controllers/application_controller.rb

    def current_user
        # debugger
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "ThZ4U3BspPogOC3Vcq5fHA"], ["LIMIT", 1]]