RedditApp/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id

        if @sub.save
---
INSERT INTO "subs" ("title", "desciption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "our app works"], ["desciption", "built a working reddit clone"], ["user_id", 4], ["created_at", "2020-12-14 20:41:32.108233"], ["updated_at", "2020-12-14 20:41:32.108233"]]

    def update
        @sub = Sub.find(params[:id])

        if (@sub.user_id == current_user.id) && @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "desciption" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["desciption", "testing the reddit clone, results: it worked"], ["updated_at", "2020-12-14 20:43:19.300741"], ["id", 2]]